src/InformationRegisters/дкл_ОчередьСообщений/дкл_ОчередьСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_ОчередьСообщений</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.дкл_ТипыСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.дкл_НаправлениеСообщения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/дкл_ОчередьСообщений/Forms/ФормаСписка/Module.bsl
&НаСервере
Перем МенеджерОбъекта;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрыСведений.дкл_ОчередьСообщений");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьЗаписи(Команда)
	ОбработатьЗаписиНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗапись(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ОбработатьЗаписьНаСервере(ТекущиеДанные.IDСообщения);
	КонецЕсли; 
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьЗаписьНаСервере(IDСообщения)                  
	СообщениеОбОшибке = МенеджерОбъекта.ОбработатьСообщение(IDСообщения);
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Сообщить(СообщениеОбОшибке);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписиНаСервере()
	МенеджерОбъекта.ОбработкаОчередиСообщений();
КонецПроцедуры

#КонецОбласти
